Tekla Open API Reference for Tekla Structures 2025
LevelMark.GetAxisAlignedBoundingBox Method
 Returns the axis aligned bounding box of the level mark (rectangle format).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RectangleBoundingBox GetAxisAlignedBoundingBox()
Public Function GetAxisAlignedBoundingBox As RectangleBoundingBox
Return Value
Type: RectangleBoundingBox
The bounding box of the level mark.
Implements
IAxisAlignedBoundingBox.GetAxisAlignedBoundingBox()
See Also
Reference
LevelMark Class
Tekla.Structures.Drawing Namespace